gloomyandy/CoreN2G/src/STM32BTC/pinmap.h

/** \addtogroup hal */
/** @{*/
/* mbed Microcontroller Library
 * Copyright (c) 2006-2013 ARM Limited
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *     http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */
#ifndef _PINMAP_H
#define _PINMAP_H

#include "PinNames.h"
#include <stdbool.h>
#include <string.h>
#if defined(__STM32H7__)
# include "stm32h7xx_hal_gpio.h"
#else
# include "stm32f4xx_hal_gpio.h"
#endif
#ifdef __cplusplus
extern "C" {
#endif

extern const uint32_t pin_map_ll[16];

#ifndef GPIO_AF_NONE
#define GPIO_AF_NONE 0
#endif
#define STM_LL_GPIO_PIN(X) (pin_map_ll[STM_PIN(X)])

// No peripheral
#define NP       0U

typedef struct {
  PinName pin;
  void *peripheral;
  int function;
} PinMap;

void pin_function(PinName pin, int function);
void pin_speed(PinName pin, int speed);
const PinMap *pinmap_find_entry(void *peripheral, PinName pin, const PinMap *map);

static inline PinName pin_pinName(const PinMap *map)
{
  return map->pin;
}

void  pinmap_pinout(PinName pin, const PinMap *map);
bool  pinmap_pinout2(void *peripheral, PinName pin, const PinMap *map);
void *pinmap_peripheral(PinName pin, const PinMap *map);
uint32_t pinmap_function(PinName pin, const PinMap *map);
void *pinmap_merge_peripheral(void *a, void *b);
#ifdef __cplusplus
}
#endif

#endif

/** @}*/
